# Curated from the current machine state.
# Homebrew owns GUI apps, system packages, and CLIs that are not already managed
# by mise. Runtimes and overlapping developer tools stay in mise instead.

tap "facebook/fb"
tap "nikitabobko/tap"
tap "wix/brew"
tap "yakitrak/yakitrak"
tap "zegervdv/zathura"

brew "apktool"
brew "btop"
brew "ccache"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "direnv"
brew "easy-rsa"
brew "ghostscript"
brew "git"
brew "glyph"
brew "grpc"
brew "idb-companion"
brew "ios-deploy"
brew "minisign"
brew "mise"
brew "neofetch"
brew "openssl@3"
brew "poppler"
brew "proctools"
brew "sourcekitten"
brew "sox"
brew "switchaudio-osx"
brew "telnet"
brew "tig"
brew "watchman"
brew "wget"
brew "worktrunk"
brew "zlib"
brew "facebook/fb/idb-companion"
brew "wix/brew/applesimutils"
brew "yakitrak/yakitrak/obsidian-cli"
brew "zegervdv/zathura/zathura-cb"
brew "zegervdv/zathura/zathura-pdf-mupdf"

cask "nikitabobko/tap/aerospace"
cask "blackhole-2ch"
cask "expo-orbit"
cask "font-hack-nerd-font"
cask "karabiner-elements"
cask "ngrok"
cask "orbstack"
cask "stats"
cask "zulu@17"

vscode "aaron-bond.better-comments"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "geddski.macros"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "johnpapa.read-time"
vscode "mathiasfrohlich.kotlin"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-ios-common-files"
vscode "orta.vscode-jest"
vscode "orta.vscode-react-native-storybooks"
vscode "planbcoding.vscode-react-refactor"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "stevencl.adddoccomments"
vscode "streetsidesoftware.code-spell-checker"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"

