# Curated from the current machine state.
# Homebrew owns GUI apps, App Store apps, system packages, and CLIs that are not
# already managed by mise. Runtimes and overlapping developer tools stay in mise
# instead.

tap "facebook/fb"
tap "felixkratz/formulae"
tap "grishka/grishka"
tap "nikitabobko/tap"
tap "wix/brew"
tap "zegervdv/zathura"

brew "apktool"
brew "borders"
brew "curl"
brew "gcc"
brew "git"
brew "ghostscript"
brew "glyph"
brew "grpc"
brew "minisign"
brew "mise"
brew "mole"
brew "openssl@3"
brew "poppler"
brew "postgresql@18"
brew "proctools"
brew "switchaudio-osx"
brew "telnet"
brew "watchman"
brew "webp"
brew "zlib"
brew "wix/brew/applesimutils"
brew "zegervdv/zathura/zathura-cb"
brew "zegervdv/zathura/zathura-pdf-mupdf"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Draw Things", id: 6444050820
mas "Endel", id: 1346247457
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Telegram", id: 747648890
mas "Transporter", id: 1450874784
mas "Portal", id: 1436994560
mas "Harvest", id: 506189836

cask "nikitabobko/tap/aerospace"
cask "beeper"
cask "blackhole-2ch"
cask "chatgpt"
cask "cursor"
cask "cyberduck"
cask "discord"
cask "expo-orbit"
cask "figma"
cask "font-hack-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "helium-browser"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "lm-studio"
cask "macs-fan-control"
cask "mole-app"
cask "multipass"
cask "neardrop"
cask "ngrok"
cask "notion-calendar"
cask "obsidian"
cask "orbstack"
cask "pgadmin4"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "stats"
cask "steam"
cask "superwhisper"
cask "synology-drive"
cask "t3-code"
cask "tailscale-app"
cask "visual-studio-code"
cask "warp"
cask "yaak"
cask "zen"
cask "zoom"
cask "zulu@17"

vscode "aaron-bond.better-comments"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "geddski.macros"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "johnpapa.read-time"
vscode "mathiasfrohlich.kotlin"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-ios-common-files"
vscode "orta.vscode-jest"
vscode "orta.vscode-react-native-storybooks"
vscode "planbcoding.vscode-react-refactor"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
